app/controllers/clients_controller.rb

SELECT "clients".* FROM "clients"
---
    def index
        @clients = Client.all
        if @clients
            @client = @clients.select{|c| c.username == params[:username]}[0]

INSERT INTO "clients" ("first_name", "last_name", "location", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "Richi"], ["last_name", "Adule"], ["location", "Brooklyn, NY"], ["username", "bigrichi"], ["created_at", "2021-03-30 19:00:16.038567"], ["updated_at", "2021-03-30 19:00:16.038567"]]
---
    def create
        @client = Client.create(client_params)

SELECT "clients".* FROM "clients" WHERE "clients"."username" = $1 LIMIT $2  [["username", "1"], ["LIMIT", 1]]
---
    def find_client
        @client = Client.find_by(params[:username])