app/controllers/git_user_clients_controller.rb

    def create
        git_user_client_params = params.permit(:client_id, :git_user_id)
        @git_user_client = GitUserClient.find_or_create_by(git_user_client_params)
---
INSERT INTO "git_user_clients" ("client_id", "git_user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["client_id", 1], ["git_user_id", 2], ["created_at", "2021-03-31 15:12:17.820941"], ["updated_at", "2021-03-31 15:12:17.820941"]]
SELECT "git_user_clients".* FROM "git_user_clients" WHERE "git_user_clients"."client_id" = $1 AND "git_user_clients"."git_user_id" = $2 LIMIT $3  [["client_id", 1], ["git_user_id", 2], ["LIMIT", 1]]

    def delete
        @git_user_client = GitUserClient.find(params[:id])
        @git_user_client.destroy
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "git_user_clients".* FROM "git_user_clients" WHERE "git_user_clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "git_user_clients" WHERE "git_user_clients"."id" = $1  [["id", 1]]