app/controllers/git_users_controller.rb

    def create
        @git_user = GitUser.create()
---
INSERT INTO "git_users" ("github_id", "login", "name", "avatar_url", "bio", "location", "site_admin", "hireable", "public_repos", "repos_url", "followers", "following", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

    def find_git_user
        @git_user = GitUser.find(params[:id])
---
SELECT "git_users".* FROM "git_users" WHERE "git_users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]