app/controllers/repositories_controller.rb

SELECT "repositories".* FROM "repositories"
---
    def index
        @repositories = Repository.all

INSERT INTO "repositories" ("git_user_id", "repo_id", "name", "description", "html_url", "language", "size", "forks_count", "commits", "events_url", "last_commit_date", "watchers", "stargazers_count", "repo_creation", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"
---
    def create
        @repository = Repository.find_or_create_by(repository_params)