app/models/git_user.rb

SELECT "repositories".* FROM "repositories" WHERE "repositories"."git_user_id" = $1  [["git_user_id", 1]]
---
    def average_stargazers
        total_stargazers/self.repositories.size